app/Controllers/Home.php

SELECT SUM(`jumlah_terjual`) AS `jumlah_terjual`
FROM `penjualan`
WHERE DATE(tgl_penjualan) = '2027-06-20'
 LIMIT 1
---
            ->selectSum('jumlah_hasil')
            ->first()['jumlah_hasil'] ?? 0;

        $totalProdukTerjualHariIniPcs = $this->penjualanModel
            ->where('DATE(tgl_penjualan)', $today)
            ->selectSum('jumlah_terjual')
            ->first()['jumlah_terjual'] ?? 0;