app/Controllers/penjualan.php

SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = 1
INSERT INTO `penjualan` (`id_produk`, `jumlah_terjual`, `harga_jual_satuan`, `total_harga`, `id_cabang`, `tgl_penjualan`, `created_at`, `updated_at`) VALUES (1, 50, '2500', 125000, 2, '2025-06-26 00:13:52', '2025-06-26 00:13:52', '2025-06-26 00:13:52')
---
    private function catatItemPenjualan(int $id_produk, int $jumlah_terjual, int $id_cabang, string $kode_transaksi, float &$totalHargaTransaksi, array &$namaProdukTerjual, bool $isTopping = false)
    {
        $produk = $this->produkModel->find($id_produk);

        if (!$produk) {
            throw new \Exception("Produk dengan ID {$id_produk} tidak ditemukan.");
        }

        $stokToDecrease = $isTopping ? ($jumlah_terjual * 50) : $jumlah_terjual;

        if ($produk['stok'] < $stokToDecrease) {
            throw new \Exception("Stok produk '{$produk['nama_produk']}' tidak mencukupi. Stok tersedia: {$produk['stok']}, dibutuhkan: {$stokToDecrease}");
        }

        $harga_jual_satuan = $produk['harga'];
        $total_harga_item = $jumlah_terjual * $harga_jual_satuan;

        $this->produkModel->decreaseStock($id_produk, $stokToDecrease);

        $dataPenjualan = [
            'kode_transaksi'    => $kode_transaksi,
            'id_produk'         => $id_produk,
            'jumlah_terjual'    => $jumlah_terjual,
            'harga_jual_satuan' => $harga_jual_satuan,
            'total_harga'       => $total_harga_item,
            'id_cabang'         => $id_cabang,
            'tgl_penjualan'     => date('Y-m-d H:i:s')
        ];
        $this->penjualanModel->insert($dataPenjualan);