app/Controllers/penjualan.php

    public function process()
    {
        $rules = [
            'id_produk'      => 'required|integer',
            'id_cabang'      => 'required|integer',
            'jumlah_terjual' => 'required|integer|greater_than[0]'
        ];

        if (!$this->validate($rules)) {
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->to('/penjualan/create')->withInput();
        }

        $id_produk = $this->request->getPost('id_produk');
        $id_cabang = $this->request->getPost('id_cabang');
        $jumlah_terjual = $this->request->getPost('jumlah_terjual');

        $db = \Config\Database::connect();
        $db->transStart();

        try {
            $produk = $this->produkModel->find($id_produk);
---
SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '1'

                'id_cabang'         => $id_cabang,
                'tgl_penjualan'     => date('Y-m-d H:i:s')
            ];
            $this->penjualanModel->insert($dataPenjualan);
---
INSERT INTO `penjualan` (`id_produk`, `jumlah_terjual`, `harga_jual_satuan`, `total_harga`, `id_cabang`, `tgl_penjualan`, `created_at`, `updated_at`) VALUES ('1', '1', '2500', 2500, '2', '2025-06-20 21:14:36', '2025-06-20 21:14:36', '2025-06-20 21:14:36')