app/Controllers/produksi.php

SELECT *
FROM `bahan_baku`
WHERE `jenis` = 'varian'
SELECT *
FROM `bahan_baku`
WHERE `jenis` = 'toping'
---
    public function create()
    {
        $pilihanVarian = $this->bahanBakuModel->where('jenis', 'varian')->findAll();
        $pilihanTopping = $this->bahanBakuModel->where('jenis', 'toping')->findAll();

INSERT INTO `log_produksi` (`id_produk`, `jumlah_hasil`, `total_modal`, `id_cabang`, `tgl_produksi`) VALUES (1, 24, 28243, '2', '2025-06-26 00:11:27')
---
            if ($produkOriginal['jumlah'] > 0) {
                $idOriginal = $this->produkModel->findOrCreateByName($produkOriginal['nama']);
                $this->produkModel->increaseStock($idOriginal, $produkOriginal['jumlah']);
                $this->produksiModel->insert([
                    'id_produk'     => $idOriginal,
                    'jumlah_hasil'  => $produkOriginal['jumlah'],
                    'total_modal'   => $totalModalProduksi, // Modal ini sudah mencakup semuanya
                    'id_cabang' => $postData['id_cabang'],
                    'tgl_produksi'  => date('Y-m-d H:i:s')
                ]);

INSERT INTO `log_produksi` (`id_produk`, `jumlah_hasil`, `total_modal`, `id_cabang`, `tgl_produksi`) VALUES (3, 1, 0, '2', '2025-06-26 00:11:27')
---
                if ($varian['jumlah'] > 0) {
                    $idVarian = $this->produkModel->findOrCreateByName($varian['nama']);
                    $this->produkModel->increaseStock($idVarian, $varian['jumlah']);
                    $this->produksiModel->insert([
                        'id_produk'     => $idVarian,
                        'jumlah_hasil'  => $varian['jumlah'],
                        'total_modal'   => 0, // Modal sudah dicatat di produk original
                        'id_cabang' => $postData['id_cabang'],
                        'tgl_produksi'  => date('Y-m-d H:i:s')
                    ]);

INSERT INTO `log_produksi` (`id_produk`, `jumlah_hasil`, `total_modal`, `id_cabang`, `tgl_produksi`) VALUES (9, '1000', 0, '2', '2025-06-24 21:08:42')
---
                if ($topping['jumlah'] > 0) {
                    $idTopping = $this->produkModel->findOrCreateByName($topping['nama']);
                    $this->produkModel->increaseStock($idTopping, $topping['jumlah']);
                    $this->produksiModel->insert([
                        'id_produk'     => $idTopping,
                        'jumlah_hasil'  => $topping['jumlah'],
                        'total_modal'   => 0, // Modal sudah dicatat di produk original
                        'id_cabang' => $postData['id_cabang'],
                        'tgl_produksi'  => date('Y-m-d H:i:s')
                    ]);