app/Controllers/produksi.php

SELECT *
FROM `bahan_baku`
---
    public function create()
    {
        $allBahan = $this->bahanBakuModel->findAll();

INSERT INTO `log_produksi` (`id_produk`, `jumlah_hasil`, `total_modal`, `id_cabang`, `tgl_produksi`) VALUES (2, 1, 0, '2', '2025-06-20 21:13:35')
---
            if ($produkOriginal['jumlah'] > 0) {
                $idOriginal = $this->produkModel->findOrCreateByName($produkOriginal['nama']);
                $this->produkModel->increaseStock($idOriginal, $produkOriginal['jumlah']);
                $this->produksiModel->insert([
                    'id_produk'     => $idOriginal,
                    'jumlah_hasil'  => $produkOriginal['jumlah'],
                    'total_modal'   => $totalModalProduksi,
                    'id_cabang' => $postData['id_cabang'],
                    'tgl_produksi'  => date('Y-m-d H:i:s')
                ]);