app/Models/bahanbakumodel.php

SELECT *
FROM `bahan_baku`
---
    public function getBahanBaku($id = false)
    {
        if ($id === false) {
            return $this->findAll();

INSERT INTO `bahan_baku` (`nama_bahan`, `harga_beli`, `satuan`, `jenis`) VALUES ('Nanas', '5000', 'Kg', 'varian')
---
    public function insertBahanBaku($data)
    {
        return $this->insert($data);

SELECT *
FROM `bahan_baku`
---
    public function getBahanPrices(): array
    {
        $allBahan = $this->findAll();