app/Models/penjualanmodel.php

SELECT `produk`.`nama_produk`, SUM(penjualan.jumlah_terjual) as total_jumlah, SUM(penjualan.total_harga) as total_pendapatan
FROM `penjualan`
JOIN `produk` ON `produk`.`id_produk` = `penjualan`.`id_produk`
GROUP BY `produk`.`nama_produk`
---
    public function getSalesSummaryByProduct()
    {
        return $this->select('produk.nama_produk, SUM(penjualan.jumlah_terjual) as total_jumlah, SUM(penjualan.total_harga) as total_pendapatan')
            ->join('produk', 'produk.id_produk = penjualan.id_produk')
            ->groupBy('produk.nama_produk')
            ->findAll();

SELECT DATE(penjualan.tgl_penjualan) as tanggal, SUM(penjualan.total_harga) as total_pendapatan_harian, SUM(penjualan.jumlah_terjual) as total_terjual_harian
FROM `penjualan`
WHERE DATE(penjualan.tgl_penjualan) >= '2025-05-24'
GROUP BY DATE(penjualan.tgl_penjualan)
ORDER BY `tanggal` DESC
---
    public function getSalesSummaryByDate($startDate = null, $endDate = null)
    {
        $builder = $this->select('DATE(penjualan.tgl_penjualan) as tanggal, SUM(penjualan.total_harga) as total_pendapatan_harian, SUM(penjualan.jumlah_terjual) as total_terjual_harian')
            ->groupBy('DATE(penjualan.tgl_penjualan)')
            ->orderBy('tanggal', 'DESC');

        if ($startDate && $endDate) {
            $builder->where('DATE(penjualan.tgl_penjualan) >=', $startDate)
                ->where('DATE(penjualan.tgl_penjualan) <=', $endDate);
        } else {
            $builder->where('DATE(penjualan.tgl_penjualan) >=', date('Y-m-d', strtotime('-30 days')));
        }

        return $builder->findAll();