app/Models/penjualanmodel.php

    public function getPenjualan()
    {
        return $this->select('penjualan.*, produk.nama_produk, cabang.nama_cabang')
            ->join('produk', 'produk.id_produk = penjualan.id_produk')
            ->join('cabang', 'cabang.id_cabang = penjualan.id_cabang', 'left')
            ->orderBy('tgl_penjualan', 'DESC')
            ->findAll();
---
SELECT `penjualan`.*, `produk`.`nama_produk`, `cabang`.`nama_cabang`
FROM `penjualan`
JOIN `produk` ON `produk`.`id_produk` = `penjualan`.`id_produk`
LEFT JOIN `cabang` ON `cabang`.`id_cabang` = `penjualan`.`id_cabang`
ORDER BY `tgl_penjualan` DESC

    public function getSalesSummaryByProduct($startDate, $endDate)
    {
        return $this->select('produk.nama_produk, SUM(penjualan.jumlah_terjual) as total_jumlah, SUM(penjualan.total_harga) as total_pendapatan')
            ->join('produk', 'produk.id_produk = penjualan.id_produk')
            ->where('DATE(penjualan.tgl_penjualan) >=', $startDate)
            ->where('DATE(penjualan.tgl_penjualan) <=', $endDate)
            ->groupBy('produk.nama_produk')
            ->orderBy('total_pendapatan', 'DESC')
            ->findAll();
---
SELECT `produk`.`nama_produk`, SUM(penjualan.jumlah_terjual) as total_jumlah, SUM(penjualan.total_harga) as total_pendapatan
FROM `penjualan`
JOIN `produk` ON `produk`.`id_produk` = `penjualan`.`id_produk`
WHERE DATE(penjualan.tgl_penjualan) >= '2025-06-26'
AND DATE(penjualan.tgl_penjualan) <= '2025-06-26'
GROUP BY `produk`.`nama_produk`
ORDER BY `total_pendapatan` DESC

    public function getSalesSummaryByCabang($startDate, $endDate)
    {
        $builder = $this->select('cabang.nama_cabang, SUM(penjualan.total_harga) as total_pendapatan_cabang, SUM(penjualan.jumlah_terjual) as total_terjual_cabang')
            ->join('cabang', 'cabang.id_cabang = penjualan.id_cabang', 'left')
            ->groupBy('cabang.nama_cabang')
            ->orderBy('total_pendapatan_cabang', 'DESC');

        if ($startDate && $endDate) {
            $builder->where('DATE(penjualan.tgl_penjualan) >=', $startDate)
                ->where('DATE(penjualan.tgl_penjualan) <=', $endDate);
        }

        return $builder->findAll();
---
SELECT `cabang`.`nama_cabang`, SUM(penjualan.total_harga) as total_pendapatan_cabang, SUM(penjualan.jumlah_terjual) as total_terjual_cabang
FROM `penjualan`
LEFT JOIN `cabang` ON `cabang`.`id_cabang` = `penjualan`.`id_cabang`
WHERE DATE(penjualan.tgl_penjualan) >= '2025-06-26'
AND DATE(penjualan.tgl_penjualan) <= '2025-06-26'
GROUP BY `cabang`.`nama_cabang`
ORDER BY `total_pendapatan_cabang` DESC

    public function getTotalRevenueForPeriod($startDate, $endDate)
    {
        $result = $this->selectSum('total_harga', 'total_revenue')
            ->where('DATE(tgl_penjualan) >=', $startDate)
            ->where('DATE(tgl_penjualan) <=', $endDate)
            ->get()
            ->getRow();
---
SELECT SUM(`total_harga`) AS `total_revenue`
FROM `penjualan`
WHERE DATE(tgl_penjualan) >= '2025-06-26'
AND DATE(tgl_penjualan) <= '2025-06-26'

    protected function createPenjualanJurnal(array $data)
    {
        if (!isset($data['id']) || !isset($data['data'])) {
            return $data;
        }

        $penjualanData = $data['data'];
        $id_penjualan = $data['id'];

        $jurnalModel = new \App\Models\JurnalModel();
        $akunModel = new \App\Models\AkunModel();

        $akunKas = $akunModel->where('kode_akun', '1-1100')->first();
        $akunPendapatan = $akunModel->where('kode_akun', '4-1100')->first();
---
SELECT *
FROM `akun`
WHERE `kode_akun` = '1-1100'
 LIMIT 1
SELECT *
FROM `akun`
WHERE `kode_akun` = '4-1100'
 LIMIT 1

                ]
            ];

            $jurnalModel->insertBatch($jurnalEntries);
---
INSERT INTO `jurnal` (`created_at`, `debit`, `deskripsi`, `id_akun`, `kredit`, `ref_id`, `ref_table`, `tgl_jurnal`, `updated_at`)
VALUES ('2025-06-26 00:13:52',125000,'Pendapatan dari penjualan ID: 3','1',0,3,'penjualan','2025-06-26 00:13:52','2025-06-26 00:13:52'), ('2025-06-26 00:13:52',0,'Pendapatan dari penjualan ID: 3','4',125000,3,'penjualan','2025-06-26 00:13:52','2025-06-26 00:13:52')