app/Models/produksimodel.php

SELECT `log_produksi`.*, `produk`.`nama_produk`, `cabang`.`nama_cabang`
FROM `log_produksi`
JOIN `produk` ON `produk`.`id_produk` = `log_produksi`.`id_produk`
JOIN `cabang` ON `cabang`.`id_cabang` = `log_produksi`.`id_cabang`
WHERE DATE(log_produksi.tgl_produksi) = '2025-06-26'
ORDER BY `log_produksi`.`tgl_produksi` ASC
---
    public function getTodaysProduction()
    {
        $today = date('Y-m-d');
        return $this->db->table('log_produksi')
            ->select('log_produksi.*, produk.nama_produk, cabang.nama_cabang')
            ->join('produk', 'produk.id_produk = log_produksi.id_produk')
            ->join('cabang', 'cabang.id_cabang = log_produksi.id_cabang')
            ->where("DATE(log_produksi.tgl_produksi)", $today)
            ->orderBy('log_produksi.tgl_produksi', 'ASC')
            ->get()->getResultArray();

SELECT `produk`.`id_produk`, `produk`.`nama_produk`, `produk`.`harga`, `produk`.`stok`
FROM `log_produksi`
JOIN `produk` ON `produk`.`id_produk` = `log_produksi`.`id_produk`
WHERE DATE(log_produksi.tgl_produksi) = '2025-06-26'
GROUP BY `produk`.`id_produk`, `produk`.`nama_produk`, `produk`.`harga`, `produk`.`stok`
---
    public function getTodaysProducedProductsWithStock()
    {
        $today = date('Y-m-d');
        return $this->select('produk.id_produk, produk.nama_produk, produk.harga, produk.stok')
            ->join('produk', 'produk.id_produk = log_produksi.id_produk')
            ->where('DATE(log_produksi.tgl_produksi)', $today)
            ->groupBy('produk.id_produk, produk.nama_produk, produk.harga, produk.stok')
            ->findAll();

SELECT `log_produksi`.*, `produk`.`nama_produk`, `cabang`.`nama_cabang`
FROM `log_produksi`
JOIN `produk` ON `produk`.`id_produk` = `log_produksi`.`id_produk`
LEFT JOIN `cabang` ON `cabang`.`id_cabang` = `log_produksi`.`id_cabang`
WHERE DATE(log_produksi.tgl_produksi) >= '2025-06-26'
AND DATE(log_produksi.tgl_produksi) <= '2025-06-26'
ORDER BY `log_produksi`.`tgl_produksi` DESC
---
    public function getProductionHistory($startDate, $endDate)
    {
        return $this->db->table('log_produksi')
            ->select('log_produksi.*, produk.nama_produk, cabang.nama_cabang')
            ->join('produk', 'produk.id_produk = log_produksi.id_produk')
            ->join('cabang', 'cabang.id_cabang = log_produksi.id_cabang', 'left')
            ->where('DATE(log_produksi.tgl_produksi) >=', $startDate)
            ->where('DATE(log_produksi.tgl_produksi) <=', $endDate)
            ->orderBy('log_produksi.tgl_produksi', 'DESC')
            ->get()->getResultArray();

SELECT `cabang`.`nama_cabang`, SUM(log_produksi.jumlah_hasil) as total_produksi_pcs, SUM(log_produksi.total_modal) as total_modal_produksi
FROM `log_produksi`
LEFT JOIN `cabang` ON `cabang`.`id_cabang` = `log_produksi`.`id_cabang`
WHERE DATE(log_produksi.tgl_produksi) >= '2025-06-26'
AND DATE(log_produksi.tgl_produksi) <= '2025-06-26'
GROUP BY `cabang`.`nama_cabang`
ORDER BY `total_modal_produksi` DESC
---
    public function getProductionSummaryByCabang($startDate, $endDate)
    {
        $builder = $this->select('cabang.nama_cabang, SUM(log_produksi.jumlah_hasil) as total_produksi_pcs, SUM(log_produksi.total_modal) as total_modal_produksi')
            ->join('cabang', 'cabang.id_cabang = log_produksi.id_cabang', 'left')
            ->where('DATE(log_produksi.tgl_produksi) >=', $startDate)
            ->where('DATE(log_produksi.tgl_produksi) <=', $endDate)
            ->groupBy('cabang.nama_cabang')
            ->orderBy('total_modal_produksi', 'DESC');

        return $builder->findAll();

SELECT SUM(`total_modal`) AS `total_cost`
FROM `log_produksi`
WHERE DATE(tgl_produksi) >= '2025-06-26'
AND DATE(tgl_produksi) <= '2025-06-26'
---
    public function getTotalModalForPeriod($startDate, $endDate)
    {
        $result = $this->selectSum('total_modal', 'total_cost')
            ->where('DATE(tgl_produksi) >=', $startDate)
            ->where('DATE(tgl_produksi) <=', $endDate)
            ->get()
            ->getRow();

SELECT *
FROM `akun`
WHERE `kode_akun` = '5-1100'
 LIMIT 1
SELECT *
FROM `akun`
WHERE `kode_akun` = '1-1100'
 LIMIT 1
---
    protected function createProduksiJurnal(array $data)
    {
        if (!isset($data['id']) || !isset($data['data'])) {
            return $data;
        }

        $produksiData = $data['data'];
        $id_log = $data['id'];

        $jurnalModel = new \App\Models\JurnalModel();
        $akunModel = new \App\Models\AkunModel();

        // Cari ID Akun Beban Pokok Produksi dan Kas
        $akunBPP = $akunModel->where('kode_akun', '5-1100')->first();
        $akunKas = $akunModel->where('kode_akun', '1-1100')->first();

INSERT INTO `jurnal` (`created_at`, `debit`, `deskripsi`, `id_akun`, `kredit`, `ref_id`, `ref_table`, `tgl_jurnal`, `updated_at`)
VALUES ('2025-06-26 00:11:27',28243,'Biaya modal untuk produksi ID: 4','5',0,4,'log_produksi','2025-06-26 00:11:27','2025-06-26 00:11:27'), ('2025-06-26 00:11:27',0,'Biaya modal untuk produksi ID: 4','1',28243,4,'log_produksi','2025-06-26 00:11:27','2025-06-26 00:11:27')
---
                ]
            ];

            $jurnalModel->insertBatch($jurnalEntries);