app/Models/produkmodel.php

    public function getProduk($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `produk`

    public function findOrCreateByName(string $namaProduk): int
    {
        $produk = $this->where('nama_produk', $namaProduk)->first();
        if ($produk) {
            return $produk['id_produk'];
        } else {
            return $this->insert(['nama_produk' => $namaProduk, 'harga' => 2500, 'stok' => 0]);
---
SELECT *
FROM `produk`
WHERE `nama_produk` = 'Pancung original'
 LIMIT 1
INSERT INTO `produk` (`nama_produk`, `harga`, `stok`) VALUES ('Pancung Nanas', 2500, 0)

    public function increaseStock(int $idProduk, int $jumlah)
    {
        $this->where('id_produk', $idProduk)->set('stok', "stok + $jumlah", false)->update();
---
UPDATE `produk` SET `stok` = stok + 24
WHERE `id_produk` = 1

    public function decreaseStock($id_produk, $quantity)
    {
        $produk = $this->find($id_produk);

        if ($produk) {
            $newStock = $produk['stok'] - $quantity;
            if ($newStock >= 0) {
                return $this->update($id_produk, ['stok' => $newStock]);
---
SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = 1
UPDATE `produk` SET `stok` = 14
WHERE `produk`.`id_produk` IN (1)

    public function getAvailableToppings()
    {
        return $this->where('stok >', 0)
            ->like('nama_produk', 'Topping %')
            ->findAll();
---
SELECT *
FROM `produk`
WHERE `stok` > 0
AND  `nama_produk` LIKE '%Topping %%' ESCAPE '!'